[
    {
        "company": "North Jersey Transport Authority",
        "logo": "../images/NJTPA.png",
        "title": "Web and App Dev",
        "dateRange": "Sep 2024 - Current",
        "bullets": [
            { "text": "Developing mock up of new NJTPA site using <strong>Django</strong> backend and <strong>React</strong> frontend for consultants to model site migration off of. Mock up includes interactive dropdown, resusable webpage components, and site navigation assistance.", "date": "Apr – Current" },
            { "text": "Deployed automated script using <strong>.NET server, custom JS scripts, and Microsoft Graph and Mail API</strong> to retrieve, compile, and post questions and answers from and for RFP consultants helping transition NJTPA site.", "date": "Jan – Mar" },
            { "text": "Built a <strong>React based budget calculator</strong> for several transport authority agencies to better plan the allocation of funds for public transport infrastructure. Site included <strong>5 realtime ChartJS data visualizations</strong> of other user's input and user savable form data to <strong>SQL Oracle Database</strong> for further analyzation.", "date": "Sept – Dec" }
        ],
        "exImage": ""
    },
    {
        "company": "Colgate Palmolive",
        "logo": "../images/CP.png",
        "title": "Software and Application Dev Intern",
        "dateRange": "June 2024 - May 2025",
        "bullets": [
            { "text": "Protoyped search engine properties for Colgate DTC Core Framework. Properties pertained to Elasticsearch's <strong>predicitve autocomplete, boosted results based on search frequency, and automatic filter toggling based off input</strong> (Filters automatically applied based off of user search input).", "date": "Feb – May" },
            { "text": "Transitioned checkout section for Global Hill's Staff Feeding to headless <strong>Liquid/Shopify CLI Framework</strong> for Korean, English, Brazillian, and Japanese pages. This resulted in better payload delivery and smoother financial transactions between business and customers.", "date": "Sept – Dec" },
            { "text": "Created a <strong>Random Forest Regression Model</strong> based off of 3 years of Testim subscription data and unit tests written for <strong>50-60 Colgate Digital Products</strong> to accurately predict Testim usage to better optimize subscription, development cycle, and features tested/test.", "date": "June - Aug" }
        ],
        "exImage": "../images/CPex.png"
    },
    {
        "company": "Fross Zelnick Lehrman Zissu",
        "logo": "../images/FZ.png",
        "title": "Acounts Payable Intern",
        "dateRange": "Aug 2023 - May 2024",
        "bullets": [
            { "text": "Peronally developed a Playwright based automation script that simulated report generation using mock data and a PostgreSQL database, reducing report analyzation and creation time from <strong>2 Hours to roughly 2 minutes on average</strong>.", "date": "Jan – May" },
            { "text": "Analyzed Microsoft SQL Service disbursement sheets and generated financial reports based off invoice date, invoice payments, and previous report status.", "date": "Aug – Dec" }
        ],
        "exImage": ""
    },
    {
        "company": "NJIT Van Huoten Library",
        "logo": "../images/NJIT.png",
        "title": "Frontend Web Dev Part Time",
        "dateRange": "Mar 2023 - May 2024",
        "bullets": [
            { "text": "Created a Highlander chatbot assistant using <strong>Angular JS and PHP</strong> that worked in tandem with Drupal CMS to assist library students with website navigation and web tool usage.", "date": "Jan – May" },
            { "text": "Integrated <strong>JSTOR, Scopus, and other journal/article database APIs</strong> into NJIT Library search engine for direct access.", "date": "Sept – Dec" },
            { "text": "Developed the mobile site for our Book Lending service using ILLiad DLL Compiler.", "date": "Mar – May" }
        ],
        "exImage": ""
    },
    {
        "company": "NJIT Ying Wu College of Computing",
        "logo": "../images/YWCC.png",
        "title": "Research Assistant",
        "dateRange": "Sept 2023 - Dec 2023",
        "bullets": [
            { "text": "Created a simple <strong>decision tree model</strong> to crudely predict where false positives of specific Java annotations are inferenced.", "date": "Nov – Dec" },
            { "text": "Created a JS Google Apps Script to strip Java Compiler annotations generated by the Checker Framework and eliminate systematic bias found in the Whole Program Inference tool. Programming bugs that appear at runtime could be inferenced and dealt with through a series of annoations.", "date": "Sept – Oct" }
        ],
        "exImage": "../images/YWCCex.png"
    },
    {
        "company": "First Tech Challenge",
        "logo": "../images/FTC.png",
        "title": "Robotics Instructor",
        "dateRange": "Sep 2022 - Current",
        "bullets": [
            { "text": "Transitioned to a <strong>mentor role</strong> aiding high school students in understanding key computer engineering and computer science topics from encoders and limit switches to software design principles.", "date": "Sept 22 – Current" },
            { "text": "Engineered and programmed several autonomous and teleoperational robots to compete in a series of events and challenges.", "date": "Sept – May 22" }
        ],
        "exImage": "../images/FTCex.png"
    }
]
